задание 1

In [ ]:
import numpy as np
import pandas as pd
arr=np.array([['лиза', '16', 'English'], ['stasya', '15', 'tennis']])
arr2=pd.DataFrame(arr, columns=['name', 'age', 'hobby'])

     name age    hobby
0    лиза  16  English
1  stasya  15   tennis

In [ ]:
import numpy as np
import pandas as pd
arr=np.array([['лиза', '16', 'English'], ['stasya', '15', 'tennis']])
arr2=pd.DataFrame(arr, columns=['name', 'age', 'hobby'])
arr3=arr2.drop([1])
arr3

   name age    hobby
0  лиза  16  English